/** @type {import('tailwindcss').Config} */
module.exports = {
  content: ["./build/*.{html,js}"],
  theme: {
    extend: {
      width: {
        5: "5%",
        10: "10%",
        15: "15%",
        15.5: "15.5%",
        25: "25%",
        30: "30%",
        14: "14%",
        3: "3px",
        300: "300vw",
        40: "40%",
        45: "45%",
        20: "20%",
        70: "70%",
        60: "60%",
        250: "250px",
      },
      height: {
        35: "35px",
        70: "70vh",
        70: "70%",
        250: "250px",
        300: "300vh",
      },
      borderRadius: {
        25: "25%",
        20: "20%",
        10: "10%",
        50: "50%",
      },
      zIndex: {
        1: "1",
        1000: "1000",
        9999: "9999",
      },
      fontSize: {
        10: "10vw",
        10: "10px",
        20: "20px",
        25: "25px",
        30: "30px",
        40: "40px",
        50: "50px",
        60: "60px",
        150: "150px",
        160: "160px",
        180: "180px",
        190: "190px",
        200: "200px",
      },
      fontFamily: {
        Righteous: ["Righteous", "sans-serif"],
      },
      maxWidth: {
        480: "480px",
      },
      maxHeight: {
        300: "300vh",
      },
      lineHeight: {
        2: "2",
      },
      colors: {
        red: "red",
      },
      top: {
        10: "10%",
        15: "15%",
        55: "55%",
      },
      left: {
        10: "10%",
        100: "100px",
      },
      right: {
        100: "100px",
      },
      bottom: {
        10: "10%",
      },
      padding: {
        50: "50px",
        60: "60px",
        80: "80px",
        30: "30px",
      },
      inset: {
        400: "400px", // 여기서 400은 400px를 나타냅니다
        40: "40%",
        10: "10px",
        340: "340px",
      },
    },
  },
  plugins: [],
};
